[IRI_SlagAbility_Passive X2AbilityTemplate]
LocFriendlyName="Singe"
LocLongDescription="Primary weapon attacks have a <Ability:SINGE_TRIGGER_CHANCE/>% chance to set fire to enemies, and Shred <Ability:SINGE_ARMOR_SHRED/> armor."
LocHelpText="Primary weapon attacks have a <Ability:SINGE_TRIGGER_CHANCE/>% chance to set fire to enemies, and Shred <Ability:SINGE_ARMOR_SHRED/> armor."
LocPromotionPopupText=""
LocFlyOverText="Singe"

[IRI_SlagAbility X2AbilityTemplate]
LocFriendlyName="Singe"
LocLongDescription="Primary weapon attacks have a <Ability:SINGE_TRIGGER_CHANCE/>% chance to set fire to enemies, and Shred <Ability:SINGE_ARMOR_SHRED/> armor."
LocHelpText="Primary weapon attacks have a <Ability:SINGE_TRIGGER_CHANCE/>% chance to set fire to enemies, and Shred <Ability:SINGE_ARMOR_SHRED/> armor."
LocPromotionPopupText=""
LocFlyOverText="Singe"

[IRI_MeltaAbility X2AbilityTemplate]
LocFriendlyName="Supercharge"
LocLongDescription="Primary weapon attacks will bypass some of the Armor of enemies at close range, and have a bonus Crit chance against them."
LocHelpText="Primary weapon attacks will bypass some of the Armor of enemies at close range, and have a bonus Crit chance against them."
LocPromotionPopupText="<bullet/> The bonuses are the strongest within 2 tiles, and equal to +6 Pierce and +20 Crit. As distances increases, bonuses get weaker, and disappear completely at 8 tiles."
LocFlyOverText="Supercharge"

